DiplomT/src/Catalogs/ДоговорыКонтрагентов/ДоговорыКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>ДоговорыКонтрагентов</name>
  <owners>Catalog.Контрагенты</owners>
  <attributes>
    <name>Организация</name>
    <type>
      <types>CatalogRef.Организации</types>
    </type>
  </attributes>
  <attributes>
    <name>ВидДоговора</name>
    <type>
      <types>EnumRef.ВидыДоговоровКонтрагентов</types>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_НачалоПериодаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_КонецПериодаДействия</name>
    <type>
      <types>Date</types>
      <dateQualifiers>
        <dateFractions>Date</dateFractions>
      </dateQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СуммаАбонентскойПлаты</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ВКМ_СтоимостьЧасаРаботы</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>15</precision>
        <scale>2</scale>
      </numberQualifiers>
    </type>
  </attributes>
</mdclass:Catalog>

DiplomT/src/Enums/ВидыДоговоровКонтрагентов/ВидыДоговоровКонтрагентов.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВидыДоговоровКонтрагентов</name>
  <enumValues>
    <name>Поставщик</name>
  </enumValues>
  <enumValues>
    <name>Покупатель</name>
  </enumValues>
  <enumValues>
    <name>ВКМ_АбонентскоеОбслуживание</name>
  </enumValues>
</mdclass:Enum>

DiplomT/src/Catalogs/ДоговорыКонтрагентов/Forms/ВКМ_ФормаОбъекта/Module.bsl
&НаКлиенте
Процедура ПриОткрытии(Отказ)
	ПриОткрытииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ПриОткрытииНаСервере()
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда	
		ВКМ_СозданиеЭлементов();
КонецЕсли;
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда	
		ВКМ_СозданиеЭлементов();
КонецЕсли;
КонецПроцедуры
//++ВКМ_Добавление элементов на форму

&НаКлиенте
Процедура ВидДоговораПриИзменении(Элемент)
	
	ПриИзмененииДоговораНаСервере();
	
КонецПроцедуры

&НаСервере
Процедура ПриИзмененииДоговораНаСервере()
	

		ВКМ_СозданиеЭлементов();

	
КонецПроцедуры

&НаСервере
Процедура ВКМ_СозданиеЭлементов()

	//Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
	Если Элементы.Найти("ДополнительныеРеквизиты") = Неопределено Тогда
		Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
			ГруппаДополнительныеРеквизиты = Элементы.Добавить("ДополнительныеРеквизиты", Тип("ГруппаФормы"), ЭтаФорма);
			ГруппаДополнительныеРеквизиты.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаДополнительныеРеквизиты.Заголовок = "Дополнительные реквизиты";
			ГруппаДополнительныеРеквизиты.Отображение = ОтображениеОбычнойГруппы.ОбычноеВыделение;
			ГруппаДополнительныеРеквизиты.ОтображатьЗаголовок = Истина;
			ГруппаДополнительныеРеквизиты.Группировка = ГруппировкаПодчиненныхЭлементовФормы.ГоризонтальнаяВсегда;

			ГруппаДополнительныеРеквизиты2 = Элементы.Добавить("ГруппаЭлементовДата", Тип("ГруппаФормы"),
				Элементы.ДополнительныеРеквизиты);
			ГруппаДополнительныеРеквизиты2.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаДополнительныеРеквизиты2.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаДополнительныеРеквизиты2.ОтображатьЗаголовок = Ложь;
			ГруппаДополнительныеРеквизиты2.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;

			ГруппаДополнительныеРеквизиты3 = Элементы.Добавить("ГруппаЭлементовСумма", Тип("ГруппаФормы"),
				Элементы.ДополнительныеРеквизиты);
			ГруппаДополнительныеРеквизиты3.Вид = ВидГруппыФормы.ОбычнаяГруппа;
			ГруппаДополнительныеРеквизиты3.Отображение = ОтображениеОбычнойГруппы.Нет;
			ГруппаДополнительныеРеквизиты3.ОтображатьЗаголовок = Ложь;
			ГруппаДополнительныеРеквизиты3.Группировка = ГруппировкаПодчиненныхЭлементовФормы.Вертикальная;
			НовыйЭлемент = Элементы.Добавить("НачалоПериодаДействия", Тип("ПолеФормы"), Элементы.ГруппаЭлементовДата);
			НовыйЭлемент.ПутьКДанным = "Объект.ВКМ_НачалоПериодаДействия";
			НовыйЭлемент.Вид = ВидПоляФормы.ПолеВвода;

			НовыйЭлемент2 = Элементы.Добавить("КонецПериодаДействия", Тип("ПолеФормы"), Элементы.ГруппаЭлементовДата);
			НовыйЭлемент2.ПутьКДанным = "Объект.ВКМ_КонецПериодаДействия";
			НовыйЭлемент2.Вид = ВидПоляФормы.ПолеВвода;

			НовыйЭлемент3 = Элементы.Добавить("СуммаАбонентскойПлаты", Тип("ПолеФормы"), Элементы.ГруппаЭлементовСумма);
			НовыйЭлемент3.ПутьКДанным = "Объект.ВКМ_СуммаАбонентскойПлаты";
			НовыйЭлемент3.Вид = ВидПоляФормы.ПолеВвода;

			НовыйЭлемент4 = Элементы.Добавить("СтоимостьЧасаРаботы", Тип("ПолеФормы"), Элементы.ГруппаЭлементовСумма);
			НовыйЭлемент4.ПутьКДанным = "Объект.ВКМ_СтоимостьЧасаРаботы";
			НовыйЭлемент4.Вид = ВидПоляФормы.ПолеВвода;

		КонецЕсли;
		
		
		
	КонецЕсли;
	
	Если Объект.ВидДоговора <> Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Если Элементы.Найти("ДополнительныеРеквизиты") <> Неопределено Тогда
			Элементы.ДополнительныеРеквизиты.Видимость = Ложь;
		КонецЕсли;
	КонецЕсли;
	
	Если Объект.ВидДоговора = Перечисления.ВидыДоговоровКонтрагентов.ВКМ_АбонентскоеОбслуживание Тогда
		Если Элементы.Найти("ДополнительныеРеквизиты") <> Неопределено Тогда
			Элементы.ДополнительныеРеквизиты.Видимость = Истина;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры
//--ВКМ_Добавление элементов на форму
